[
  {
    "title": "BFV - An In Depth Review",
    "slug": "bfv-an-in-depth-review",
    "published_on": "September 15, 2021",
    "main_image": "https://escapethelevel.com/wp-content/uploads/2016/02/FEATBFF1.jpg",
    "author": {
      "discord_user_id": "350695800453726209",
      "discord_avatar_hash": "1280d590591b25e2202bc81da7a84801",
      "discord_nickname": "BlahAbyss1",
      "about": "I like turtles. Like, I really, really like turtles."
    },
    "categories": [
      {
        "category_id":1,
        "category_name": "Reviews"
      }
    ],
    "tags": [
      {
        "tag_id": 1,
        "tag_name": "BFV"
      }
    ],
    "brief": "<p class=\"card-text mb-5\">Battlefield V suffered greatly at release and rightly drew the ire and criticism of the Battlefield community due to serious; bugs, content voids and an identity crisis of revisionist and actual history. With its relatively small amount of DLC and content drops many in the gaming community would simply write this game off as a fluke and move on, however Battlefield V contains far too much quality content to be dismissed...</p>",
    "body": "<p class=\"card-text mb-5\">Battlefield V suffered greatly at release and rightly drew the ire and criticism of the Battlefield community due to serious; bugs, content voids and an identity crisis of revisionist and actual history. With its relatively small amount of DLC and content drops many in the gaming community would simply write this game off as a fluke and move on, however Battlefield V contains far too much quality content to be dismissed out of hand and it is very important that DICE not only learn from their mistakes, but more importantly from their successes.</p><h4>New Battlefields</h4><hr/><h5>The Good</h5><p class=\"card-text\">Battlefield V returned the series to a World War II setting, something that fans have wanted for quite some time (the last historical title in the series launched in 2009). This return offered a look at battles never seen on screen and battlefields forgotten by the mainstream culture expanding the perspective of the war to include, battles in Belgium and Norway as well as a welcome return to the Pacific theatre. Narvik and Fjelll are both interesting set pieces. Rotterdam features hectic street to street fighting where any fans of battlefield 3’s Seine Crossing will be right at home.</p><h5>The Bad</h5><p class=\"card-text mb-5\">This new emphasis on the forgotten battles would be very welcome were it not for the fact that in focusing so heavily on them DICE abandoned some of the most legendary battles of the war. The lack of eastern front gameplay hurts the game severely, some of the bloodiest and most chaotic tank and infantry combat of the war (Kursk, Stalingrad ,Moscow, Berlin) all took place on this front and almost all of the vehicles, weapons and tactics available for DICE to let the players work with are missing. The Battles of Britain and Guadalcanal where some of the most intense aircraft combat of the war took place are completely absent as well, with only minimal effort required to put the already created assets in the game to work this is hardly forgivable.</p><h4>Expanding/Shrinking Arsenal</h4><hr/><h5>The Good</h5><p class=\"card-text\">The arsenal the players are able to work with in Battlefield V is unparalleled by any game in the franchise or other series. The weapon variety is diverse and satisfying to use, and customizable down different upgrade tracks allowing for players to mix and match their preferred weapon to fit their preferred play-style, in this design, no setup is optimal in every situation which balances gunplay fantastically. The vehicle gameplay is where Battlefield V truly stands out. Each Vehicle is different from its counterparts not only in armor or speed but in reload time, trench clearing capability, handling, turret traverse, and armor piercing and high explosive payload and shell velocity. There is even a massive difference between vehicles of the same type, two different Sherman Tanks can be equipped with different smoke launching configurations, guns and armor augments, leading to nearly endless options when using these vehicles. For example, the Panzer 38t, my personal favorite vehicle can be customized to replace its man 37mm anti-tank gun with a 20mm autocannon for extra effectiveness against infantry but reduced effectiveness against vehicles. This expansion of customization options makes Battlefield V’s vehicle gameplay some of the best in the series. Adding the UK as a playable faction further expanded the player’s arsenal of military equipment including iconic vehicles like the Spitfire fighter plane and the Churchill heavy tank instead of being stuck with the same US and German vehicles every game that are often just cosmetic skin changes to otherwise identical vehicles. The number and variety of armor available to all the factions is impressive and is an amazing change that provides freedom to the player all while remaining balanced and period accurate.</p><h5>The Bad</h5><p class=\"card-text mb-5\">The Japanese vehicle roster is rather limited, but this doesn't affect gameplay in a very dramatic way as the defensive equipment built into the maps helps to make up for it in the Pacific. The lack of an Eastern Front section of the game really hurts the experience, while the players toolbox has expanded enormously it is also oddly cramped, no Mosin-Nagant, SVT, PTRS, or PPSH and no T34, BT or KV tanks makes the game feel just incomplete. it not for an under delivered dlc experience the game could be the best WWII game of the last 20 years.</p><h4>Team Play</h4><hr/><h5>The Good</h5><p class=\"card-text\">Battlefield V’s division of equipment and labor promotes team play at every turn. The new subdivisions of classes enable players to specialize in what their class has to offer. Assault is now geared entirely for aggression and taking on enemy vehicles, carrying grenade launchers, bazookas and a host of grenades but has trouble holding a defensive position against multiple opponents. Medic is devastating in close quarters with their sub machine guns and health-packs, but struggle at longer ranges. Support is fantastic at quickly building fortifications, (a fantastic new system that deserves its own article) allowing them to hold a position from medium to close range with high ROF machine guns and shot guns while still struggling over long distances and in high mobility engagements. Recon is still mainly a sniper class but its spotting flares and pistol carbines give the class up close intel advantages that allow them to compete against more heavily armed classes. How all this comes together is the way gameplay is divided, every class is rewarded for being with their teammates, and working with their fellow squads. Vehicles have more health than previous games and require coordinated effort from multiple assault and support troops to take them down. Limited health regeneration mean coordinating Medics are a necessity to keep your team healthy and in the fight, and constructing advanced fortifications like anti-tank and anti-air guns makes support invaluable in holding off enemy vehicles. The rework of the spotting mechanic makes recon players much more valuable closer in to the action as their spot flares make it possible to truly secure an area from hiding hostiles. All of these attributes combined makes Battlefield V an amazing experience to play in a Mil-Sim environment (like the fighting 36th ) where teamwork and communication are so greatly rewarded.</p><h5>The Bad</h5><p class=\"card-text mb-5\">Because of the emphasis on teamwork, playing the game alone or with randoms can be a definite slog that can leave you frustrated. The highly specialized nature of the roles can sometimes lead to situations where the role you play is useless in certain scenarios, leading to some frustration for medics who have to stand around twiddling their thumbs during tank engagements.</p><h4>Game Modes/Maps</h4><hr/><h5>The Good</h5><p class=\"card-text\">The maps in BFV are incredibly well designed for Grand Operations, and Breakthrough game modes. Both modes make excellent use of the fortification mechanics to allow aggressive players to blitzkreig enemies before their defenses are ready and allow for players to defend in depth in a way that hasn’t been present in any game in the genre. The Pacific DLC only enhances this focus for attack/defend game modes allowing for jaw-dropping beach landings and airborne assaults behind enemy lines.</p><h5>The Bad</h5><p class=\"card-text mb-5\">The maps in BFV are often not well optimized for conquest, oftentimes players will spend 2 to 3 minutes just walking from objective to objective with no contact with enemy forces. This leads to repetitive gameplay loops, and people standing around waiting for vehicles to spawn. This can be minimized if working with a team, but isn’t enjoyable if you’re by yourself. Another problem is the lack of maps and game modes, besides Grand Operations and Breakthrough, their is a lack of imagination that you can feel when playing the game. Large scale tank and air battles present in previous games in the franchise are completely absent in a game set with countless inspirations available.</p><h4>Conclusion</h4><p class=\"card-text\">Battlefield V is mixed bag of great fresh gameplay mechanics, advancements in rewarding team play and incredible customization options, but clearly suffered from development crunch resulting in a lack of imagination and content voids that shouldn’t be present in a AAA game. Hopefully DICE and EA learn from their mistakes when making Battlefield 2042 but also learn from their successes, as there are far too many good things in BFV to write off as a bad dream.</p>"
  }
]